TRUNCATE TABLE chances CASCADE;
TRUNCATE TABLE boxes CASCADE ;
INSERT INTO boxes (id, name, price, rarity_id)
VALUES
    (1001, 'Супер Мега Кейс', 1000, 2),
    (1002, 'Счастливая Удача', 1000, 3),
    (1003, 'Дикая Охота', 1000, 4),
    (1004, 'Разъяренный Кейс', 1000, 1),
    (1005, 'Выигрыш Обеспечен', 1000, 2),
    (1006, 'Рев Дракона', 1000, 3),
    (1007, 'Большая Ферма', 1000, 4),
    (1008, 'Маленькая Ферма', 1000, 1),
    (1009, 'Рассадник Питомцев', 1000, 2);
INSERT INTO chances (id, box_id, pet_card_id, percent)
VALUES
    (1001, 1001, 1001, 10),
    (1002, 1001, 1002, 6),
    (1003, 1001, 1003, 6),
    (1004, 1001, 1004, 6),
    (1005, 1001, 1005, 6),
    (1006, 1001, 1006, 6),
    (1007, 1001, 1007, 6),
    (1008, 1001, 1008, 6),
    (1009, 1001, 1009, 6),
    (1010, 1001, 1010, 6),
    (1011, 1001, 1011, 6),
    (1012, 1001, 1012, 6),
    (1013, 1001, 1013, 6),
    (1014, 1001, 1014, 6),
    (1015, 1001, 1015, 6),
    (1016, 1001, 1016, 6),
    (1017, 1002, 1001, 100),
    (1018, 1002, 1002, 100),
    (1019, 1002, 1003, 100),
    (1020, 1002, 1004, 100),
    (1021, 1002, 1005, 100),
    (1022, 1002, 1006, 100),
    (1023, 1002, 1007, 100),
    (1024, 1002, 1008, 100);
ALTER SEQUENCE boxes_seq RESTART WITH 1010;
ALTER SEQUENCE chances_seq RESTART WITH 1010;